@ocofaigh When determining whether an upgrade would destroy any buckets, this is the output returned. The code will generate test-cos-bucket-1 and test-cos-bucket-2 if no buckets are specified, just as it does in the original code from the master branch (complete example). So, only the CBR rules will be deleted and recreated when we do the upgrade, as shown below.

`Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.cos_bucket1.module.bucket_cbr_rule[0].ibm_cbr_rule.cbr_rule will be destroyed
  # (because module.cos_bucket1.module.bucket_cbr_rule[0] is not in configuration)
  - resource "ibm_cbr_rule" "cbr_rule" {
      - created_at          = "2023-03-15T21:44:18.000Z" -> null
      - created_by_id       = "IBMid-550007TT57" -> null
      - crn                 = "crn:v1:bluemix:public:context-based-restrictions:global:a/ACCOUNT_ID::rule:e0c38fce921c33684de5e626be9a42af" -> null
      ....
    }

  # module.cos_bucket1.module.bucket_cbr_rule["test-cos-bucket-1"].ibm_cbr_rule.cbr_rule will be created
  + resource "ibm_cbr_rule" "cbr_rule" {
      + created_at          = (known after apply)
      + created_by_id       = (known after apply)
      + crn                 = (known after apply)
      + description         = "sample rule for bucket 1"
      + enforcement_mode    = "report"
      ....
    }

  # module.cos_bucket2.module.bucket_cbr_rule[0].ibm_cbr_rule.cbr_rule will be destroyed
  # (because module.cos_bucket2.module.bucket_cbr_rule[0] is not in configuration)
  - resource "ibm_cbr_rule" "cbr_rule" {
      - created_at          = "2023-03-15T21:44:18.000Z" -> null
      - created_by_id       = "IBMid-550007TT57" -> null
      - crn                 = "crn:v1:bluemix:public:context-based-restrictions:global:a/ACCOUNT_ID::rule:e0c38fce921c33684de5e626be9a3ddc" -> null
      ....
    }

  # module.cos_bucket2.module.bucket_cbr_rule["test-cos-bucket-2"].ibm_cbr_rule.cbr_rule will be created
  + resource "ibm_cbr_rule" "cbr_rule" {
      + created_at          = (known after apply)
      + created_by_id       = (known after apply)
      + crn                 = (known after apply)
      + description         = "sample rule for bucket 2"
      + enforcement_mode    = "report"
      ....
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - bucket_name1 = [
      - "test-cos-bucket-1",
    ] -> null
  - bucket_name2 = [
      - "test-cos-bucket-2",
    ] -> null
  + buckets      = {
      + test-cos-bucket-1 = {
          + bucket_crn           = "crn:v1:bluemix:public:cloud-object-storage:global:a/ACCOUNT_ID:9309ec9b-e103-46f5-84c5-344a682eafaa:bucket:test-cos-bucket-1"
          + bucket_id            = "crn:v1:bluemix:public:cloud-object-storage:global:a/ACCOUNT_ID:9309ec9b-e103-46f5-84c5-344a682eafaa:bucket:test-cos-bucket-1:meta:rl:us-south:public"
          + bucket_name          = "test-cos-bucket-1"
          + bucket_storage_class = "standard"
          + cos_instance_guid    = "9309ec9b-e103-46f5-84c5-344a682eafaa"
          + cos_instance_id      = "crn:v1:bluemix:public:cloud-object-storage:global:a/ACCOUNT_ID:9309ec9b-e103-46f5-84c5-344a682eafaa::"
          + key_protect_key_crn  = "crn:v1:bluemix:public:kms:us-south:a/ACCOUNT_ID:acd6591b-6693-4724-b3dc-8c2ce90003d7:key:a4d412af-2ab5-4ddc-ab48-df02c6fa028d"
          + resource_group_id    = "65460e85d7e3445f8abcb7ed2e23bb39"
          + s3_endpoint_private  = "s3.private.us-south.cloud-object-storage.appdomain.cloud"
          + s3_endpoint_public   = "s3.us-south.cloud-object-storage.appdomain.cloud"
        }
      + test-cos-bucket-2 = {
          + bucket_crn           = "crn:v1:bluemix:public:cloud-object-storage:global:a/ACCOUNT_ID:9309ec9b-e103-46f5-84c5-344a682eafaa:bucket:test-cos-bucket-2"
          + bucket_id            = "crn:v1:bluemix:public:cloud-object-storage:global:a/ACCOUNT_ID:9309ec9b-e103-46f5-84c5-344a682eafaa:bucket:test-cos-bucket-2:meta:crl:us:public"
          + bucket_name          = "test-cos-bucket-2"
          + bucket_storage_class = "standard"
          + cos_instance_guid    = "9309ec9b-e103-46f5-84c5-344a682eafaa"
          + cos_instance_id      = "crn:v1:bluemix:public:cloud-object-storage:global:a/ACCOUNT_ID:9309ec9b-e103-46f5-84c5-344a682eafaa::"
          + key_protect_key_crn  = "crn:v1:bluemix:public:kms:us-south:a/ACCOUNT_ID:acd6591b-6693-4724-b3dc-8c2ce90003d7:key:a4d412af-2ab5-4ddc-ab48-df02c6fa028d"
          + resource_group_id    = "65460e85d7e3445f8abcb7ed2e23bb39"
          + s3_endpoint_private  = "s3.private.us.cloud-object-storage.appdomain.cloud"
          + s3_endpoint_public   = "s3.us.cloud-object-storage.appdomain.cloud"
        }
    }
`